/*7.9. Удаление скобок 3 (6)
Последовательность круглых скобок называют правильной, если можно добавить в нее
числа и знаки арифметических операций так, что полученное алгебраическое выражение
станет корректным. Например, скобочная последовательность (())() является правильной,
а (())) и ())(() такими не являются. Пустая скобочная последовательность считается
правильной.
Задана скобочная последовательность из n круглых скобок (1 ≤ n ≤ 6×10 5 ). Какое
минимальное количество скобок можно удалить так, чтобы последовательность оказалась
правильной?
*/
#include <iostream>
#include <fstream>

int main()
{
    int n;
    int opened = 0;
    int sum = 0;
    std::string buf;

    std::ifstream in("INPUT.TXT");
    std::ofstream out("OUTPUT.TXT");

    if (!in.is_open()) { return 0; }

    in >> n;

    if (n < 1 || n > 6 * 10e4) { return 0; }

    in >> buf;

    for (int i = 0; i < n; i++)
    {
        if (buf[i] == '(') { opened++; }

        else if (buf[i] = ')')
        {
            if (opened > 0) { opened--; }
            else { sum++; }
        }
    }

    sum += opened;
    out << sum;

    return 0;
}
